# Not required anymore
#tap "homebrew/cask"

#cask "google-chrome"

cask "karabiner-elements"
cask "hammerspoon"
cask "docker"
cask "raycast"
# TODO: test wezterm
cask "alacritty"
cask "slack"
cask "zoom"
cask "figma"
cask "notion"

brew "neovim"
brew "tmux"
# brew "anyenv" dropped in favor of mise
brew "mise"

brew "starship"
brew "fzf"
# TODO: use zi to innvoke fzf
brew "zoxide"
# python dependencies
brew "xz"
brew "ripgrep"

brew "tfenv"
brew "tgenv"
brew "gh"

brew "awscli"
