brew 'qt55'
# run 'brew link --force qt55'
# https://github.com/thoughtbot/capybara-webkit/wiki/Installing-Qt-and-compiling-capybara-webkit

brew 'zsh', args: ['--disable-etcdir']
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'macvim', args: ['--override-system-vim']
# brew 'peco'
brew 'fasd'
# brew 'z'
brew 'git'
brew 'git-lfs'
brew 'tig'
brew 'mercurial'
brew 'the_silver_searcher'
brew 'postgresql'
brew 'mysql'
brew 'hub'
brew 'ctags'
brew 'cmake'
brew 'ag'
brew 'global', args: ['--with-exuberant-ctags', '--with-pygments']
brew 'watchman'
brew 'mitmproxy'

#cask 'karabiner'
#cask 'seil'

cask 'slate'

cask 'virtualbox'
cask 'vagrant'

# older
#brew 'emacs', args: ['--with-modules', '--with-cocoa', '--with-gnutls', '--with-librsvg', '--with-mailutils', '--with-imagemagick@6']
# brew linkapps
# brew pin imagemagick@6
#

# new
cask 'emacs'
brew 'cask'

# cask 'mactex'
# sudo tlmgr install dvipng

brew 'r'

# https://www.docker.com/docker-mac
#brew 'docker'
#brew 'docker-machine'
#brew 'docker-compose'

brew 'pyenv'
brew 'pyenv-virtualenv'

brew 'v8'
brew 'openssl'
brew 'redis'

#cask 'easysimbl'
cask 'google-cloud-sdk'
cask 'java'
brew 'maven'
