# brew 'qt55'
# run 'brew link --force qt55'
# https://github.com/thoughtbot/capybara-webkit/wiki/Installing-Qt-and-compiling-capybara-webkit

brew 'zsh' #, args: ['--disable-etcdir']
brew 'jq'
brew 'tmux'
#brew 'reattach-to-user-namespace'
#brew 'macvim', args: ['--override-system-vim']
brew 'neovim'
cask 'iterm2'
# brew 'peco'
brew 'fasd'
# brew 'zplug'
# TODO: install zinit and prompt themes(powerlevel/pure/starship)
# https://github.com/zdharma-continuum/zinit#plugins-and-snippets
# brew 'z'
brew 'git'
brew 'git-lfs'
brew 'tig'
brew 'wget'
brew 'mercurial'
#brew 'the_silver_searcher'
brew 'ripgrep'
#brew 'postgresql'
#brew 'mysql'
brew 'hub'
#brew 'ctags'
brew 'ctags-exuberant'
brew 'cmake'
brew 'automake'
#brew 'ag'
#brew 'global', args: ['--with-exuberant-ctags', '--with-pygments']
brew 'watchman'
brew 'mitmproxy'
brew 'just'
brew 'kubectx'
brew 'anyenv'
brew 'direnv'

#cask 'karabiner'
#cask 'seil'

#cask 'slate'
cask 'hammerspoon'

# cask 'virtualbox'
cask 'vagrant'

cask 'google-japanese-ime'

# brew 'sshrc'
# brew 'sshpass'
# brew install http://git.io/sshpass.rb
brew 'mosh'

# older
#brew 'emacs', args: ['--with-modules', '--with-cocoa', '--with-gnutls', '--with-librsvg', '--with-mailutils', '--with-imagemagick@6']
# brew linkapps
# brew pin imagemagick@6
#

# new
# cask 'emacs'

# emacs-plus
tap 'd12frosted/emacs-plus'

# Getting Emacs to tile #86
# https://github.com/koekeishiya/yabai/issues/86#issuecomment-529935058
# (menu-bar-mode t)
# brew 'emacs-plus', args: ['with-no-titlebar', 'with-modern-icon','head']
brew 'emacs-plus', args: ['with-modern-icon','head']

# cask 'mactex'
# sudo tlmgr install dvipng

brew 'r'

# https://www.docker.com/docker-mac
brew 'docker'
#brew 'docker-machine'
#brew 'docker-compose'

#brew 'pyenv'
#brew 'pyenv-virtualenv'

#brew 'v8'
#brew 'openssl'
# For installing older ruby(that needs openssl 1.0) < 2.4
# https://qiita.com/Nakapon1214/items/64144b34166ed1017050
#brew 'redis'

#cask 'easysimbl'
#cask 'google-cloud-sdk'
#cask 'java'
#brew 'maven'
brew 'pngpaste'

tap "koekeishiya/formulae"
# you need self cert(yabai-cert)
# https://github.com/koekeishiya/yabai/wiki/Installing-yabai-(from-HEAD)
brew 'yabai', args: ['HEAD']
brew 'skhd', args: ['with-logging']

# this includes NotoSansMonoCJKjp-Regular.otf
cask 'homebrew/cask-fonts/font-noto-sans-cjk-jp'

brew 'awscli'

# rails dependencies
# https://qiita.com/asip2k25/items/c019c766a53f4b28df6d
brew 'libxml2'
brew 'libxslt'
brew 'libiconv'
brew 'imagemagick'
brew 'mysql'

tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

tap 'sanemat/font'
brew 'ricty', args: ['with-powerline']
brew 'lazygit'
