brew tap homebrew/versions
brew 'qt55'
# run 'brew link --force qt55'
# https://github.com/thoughtbot/capybara-webkit/wiki/Installing-Qt-and-compiling-capybara-webkit

brew 'zsh', args: ['--disable-etcdir']
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'macvim', args: ['--override-system-vim']
# brew 'peco'
brew 'fasd'
# brew 'z'
brew 'git'
brew 'tig'
brew 'mercurial'
brew 'the_silver_searcher'
brew 'postgresql'
brew 'mysql'
brew 'hub'
brew 'dotjs'
brew 'ctags'
brew 'cmake'

cask 'karabiner'
cask 'seil'

cask 'slate'

cask 'virtualbox'
cask 'vagrant'


brew 'docker'
brew 'docker-machine'

brew 'caskroom/cask/brew-cask'
brew 'pyenv'
brew 'pyenv-virtualenv'

brew 'v8'
brew 'openssl'
brew 'redis'

cask 'easysimbl'
cask 'google-cloud-sdk'
cask 'java'
brew 'maven'
